https://reportcard.education.ohio.gov/

https://reportcard.education.ohio.gov/download

District Achievement reports
* 1516_DIST_ACH2.xls
* 1617_DISTRICT_ACHIEVEMENT.xls
* 17-18_Achievement_District.xlsx

Note these workbooks, have multiple sheets in them

In [3]:
from re import compile as re_compile, IGNORECASE

import numpy as np
import pandas as pd

In [4]:
# Make sure that we're grabbing the correct columns
temp = pd.read_excel(
    '1516_DIST_ACH2.xls', 
    sheet_name=1,
    index_col='District IRN', 
    usecols=[
        'District Name',
         'Math 5th Grade 2015-16 % at or above Proficient - District',
         'Math 4th Grade 2014-15 % at or above Proficient -District',
         'Math 3rd Grade 2013-14 % at or above Proficient - District'
    ],
)

temp.head(1)

,District Name,Math 5th Grade 2015-16 % at or above Proficient - District,Math 4th Grade 2014-15 % at or above Proficient -District,Math 3rd Grade 2013-14 % at or above Proficient - District
District IRN,,,,
442,Manchester Local,68.8,36.1,76.6

In [3]:
grade_3_to_5 = pd.read_excel(
    '1516_DIST_ACH2.xls', 
    sheet_name=1,
    names=['District Name', 'grade-5 2015', 'grade-4 2014', 'grade3-2013'],
    index_col='District IRN', 
    usecols=[
        'District Name',
         'Math 5th Grade 2015-16 % at or above Proficient - District',
         'Math 4th Grade 2014-15 % at or above Proficient -District',
         'Math 3rd Grade 2013-14 % at or above Proficient - District'
    ],
    dtype={
        'District Name': object,
        'grade-5 2015': np.float64,
        'grade-4 2014': np.float64,
        'grade-3 2013': np.float64,
    },
)

grade_3_to_5.head(5)

                    District Name grade-5 2015 grade-4 2014 grade3-2013
District IRN
442              Manchester Local         68.8         36.1        76.6
43489                  Akron City         43.1         55.7        68.3
43497               Alliance City         54.5         48.5        81.3
43505                Ashland City           74         74.8        84.6
43513         Ashtabula Area City         54.9         70.2        62.6

In [15]:
grade_3_to_5['grade-5 2015']

District IRN
442       68.8
43489     43.1
43497     54.5
43505       74
43513     54.9
43521     64.5
43539     56.7
43547     98.4
43554     93.3
43562     49.4
43570       78
43588     63.4
43596     74.6
43604     79.7
43612       46
43620     71.8
43638     67.9
43646     90.8
43653     53.3
43661     74.4
43679     70.9
43687       47
43695     69.1
43703     21.5
43711     45.8
43729       72
43737     76.9
43745     59.6
43752     41.7
43760     61.7
          ...
50450     92.4
50468     91.1
50484     71.6
50492       32
50500     56.6
50518       78
50534       80
50542     73.3
50559     77.3
50567     86.8
50575     74.5
50583     84.9
50591     86.3
50617     74.4
50625     87.8
50633     57.1
50641     77.6
50658     65.6
50674     86.1
50682     83.9
50690     72.6
50708     56.5
50716     63.1
50724     57.4
50740     70.5
61903     54.9
65680     64.9
69682     52.1
91397       40
139303    86.7
Name: grade-5 2015, Length: 608, dtype: object

In [4]:
pd.read_excel(
    '17-18_Achievement_District.xlsx', 
    sheet_name=1,
    index_col='District IRN',
    usecols="A,AU,CT",
).head(1)

,7th Grade Math 2017-18 % at or above Proficient - District,6th Grade Math 2016-17 % at or above Proficient - District
District IRN,,
442,46.3,74.1

In [5]:
grades_6_to_7 = pd.read_excel(
    '17-18_Achievement_District.xlsx', 
    sheet_name=1,
    names=['grade-7 2017', 'grade-6 2016'], 
    index_col='District IRN',
    usecols="A,AU,CT",
    dtype={
        'District Name': object,
        'grade-7 2017': np.float64,
        'grade-6 2016': np.float64,
    },
)

grades_6_to_7.head(5)

             grade-7 2017 grade-6 2016
District IRN
442                  46.3         74.1
43489                32.5         33.1
43497                27.1         29.8
43505                73.3           66
43513                  29         47.5

In [9]:
grades_3_to_7 = pd.merge(grade_3_to_5, grades_6_to_7, on='District IRN')
grades_3_to_7.head(5)

,District Name,grade-5 2015,grade-4 2014,grade3-2013,grade-7 2017,grade-6 2016
District IRN,,,,,,
442,Manchester Local,68.8,36.1,76.6,46.3,74.1
43489,Akron City,43.1,55.7,68.3,32.5,33.1
43497,Alliance City,54.5,48.5,81.3,27.1,29.8
43505,Ashland City,74,74.8,84.6,73.3,66
43513,Ashtabula Area City,54.9,70.2,62.6,29,47.5

In [12]:
grades_3_to_7['grade-5 2015']

District IRN
442       68.8
43489     43.1
43497     54.5
43505       74
43513     54.9
43521     64.5
43539     56.7
43547     98.4
43554     93.3
43562     49.4
43570       78
43588     63.4
43596     74.6
43604     79.7
43612       46
43620     71.8
43638     67.9
43646     90.8
43653     53.3
43661     74.4
43679     70.9
43687       47
43695     69.1
43703     21.5
43711     45.8
43729       72
43737     76.9
43745     59.6
43752     41.7
43760     61.7
          ...
50450     92.4
50468     91.1
50484     71.6
50492       32
50500     56.6
50518       78
50534       80
50542     73.3
50559     77.3
50567     86.8
50575     74.5
50583     84.9
50591     86.3
50617     74.4
50625     87.8
50633     57.1
50641     77.6
50658     65.6
50674     86.1
50682     83.9
50690     72.6
50708     56.5
50716     63.1
50724     57.4
50740     70.5
61903     54.9
65680     64.9
69682     52.1
91397       40
139303    86.7
Name: grade-5 2015, Length: 608, dtype: object

In [18]:
pd.__version__

'0.23.1'

In [17]:
[s for s in dir(pd) if 'version' in s.lower()]

['__version__',
 '_np_version_under1p10',
 '_np_version_under1p11',
 '_np_version_under1p12',
 '_np_version_under1p13',
 '_np_version_under1p14',
 '_np_version_under1p15',
 '_version',
 'show_versions']

In [16]:
help(pd.read_excel)

Help on function read_excel in module pandas.io.excel:

read_excel(io, sheet_name=0, header=0, names=None, index_col=None, usecols=None, squeeze=False, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skiprows=None, nrows=None, na_values=None, parse_dates=False, date_parser=None, thousands=None, comment=None, skipfooter=0, convert_float=True, **kwds)
    Read an Excel table into a pandas DataFrame

    Parameters
    ----------
    io : string, path object (pathlib.Path or py._path.local.LocalPath),
        file-like object, pandas ExcelFile, or xlrd workbook.
        The string could be a URL. Valid URL schemes include http, ftp, s3,
        and file. For file URLs, a host is expected. For instance, a local
        file could be file://localhost/path/to/workbook.xlsx
    sheet_name : string, int, mixed list of strings/ints, or None, default 0

        Strings are used for sheet names, Integers are used in zero-indexed
        sheet positions.

        Lists of strings/integers are used to request multiple sheets.

        Specify None to get all sheets.

        str|int -> DataFrame is returned.
        list|None -> Dict of DataFrames is returned, with keys representing
        sheets.

        Available Cases

        * Defaults to 0 -> 1st sheet as a DataFrame
        * 1 -> 2nd sheet as a DataFrame
        * "Sheet1" -> 1st sheet as a DataFrame
        * [0,1,"Sheet5"] -> 1st, 2nd & 5th sheet as a dictionary of DataFrames
        * None -> All sheets as a dictionary of DataFrames

    sheetname : string, int, mixed list of strings/ints, or None, default 0

        .. deprecated:: 0.21.0
           Use `sheet_name` instead

    header : int, list of ints, default 0
        Row (0-indexed) to use for the column labels of the parsed
        DataFrame. If a list of integers is passed those row positions will
        be combined into a ``MultiIndex``. Use None if there is no header.
    names : array-like, default None
        List of column names to use. If file contains no header row,
        then you should explicitly pass header=None
    index_col : int, list of ints, default None
        Column (0-indexed) to use as the row labels of the DataFrame.
        Pass None if there is no such column.  If a list is passed,
        those columns will be combined into a ``MultiIndex``.  If a
        subset of data is selected with ``usecols``, index_col
        is based on the subset.
    parse_cols : int or list, default None

        .. deprecated:: 0.21.0
           Pass in `usecols` instead.

    usecols : int or list, default None
        * If None then parse all columns,
        * If int then indicates last column to be parsed
        * If list of ints then indicates list of column numbers to be parsed
        * If string then indicates comma separated list of Excel column letters and
          column ranges (e.g. "A:E" or "A,C,E:F").  Ranges are inclusive of
          both sides.
    squeeze : boolean, default False
        If the parsed data only contains one column then return a Series
    dtype : Type name or dict of column -> type, default None
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32}
        Use `object` to preserve data as stored in Excel and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.

        .. versionadded:: 0.20.0

    engine: string, default None
        If io is not a buffer or path, this must be set to identify io.
        Acceptable values are None or xlrd
    converters : dict, default None
        Dict of functions for converting values in certain columns. Keys can
        either be integers or column labels, values are functions that take one
        input argument, the Excel cell content, and return the transformed
        content.
    true_values : list, default None
        Values to consider as True

        .. versionadded:: 0.19.0

    false_values : list, default None
        Values to consider as False

        .. versionadded:: 0.19.0

    skiprows : list-like
        Rows to skip at the beginning (0-indexed)
    nrows : int, default None
        Number of rows to parse

        .. versionadded:: 0.23.0

    na_values : scalar, str, list-like, or dict, default None
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values. By default the following values are interpreted
        as NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', 'N/A', 'NA', 'NULL', 'NaN', 'n/a', 'nan',
        'null'.
    keep_default_na : bool, default True
        If na_values are specified and keep_default_na is False the default NaN
        values are overridden, otherwise they're appended to.
    verbose : boolean, default False
        Indicate number of NA values placed in non-numeric columns
    thousands : str, default None
        Thousands separator for parsing string columns to numeric.  Note that
        this parameter is only necessary for columns stored as TEXT in Excel,
        any numeric columns will automatically be parsed, regardless of display
        format.
    comment : str, default None
        Comments out remainder of line. Pass a character or characters to this
        argument to indicate comments in the input file. Any data between the
        comment string and the end of the current line is ignored.
    skip_footer : int, default 0

        .. deprecated:: 0.23.0
           Pass in `skipfooter` instead.
    skipfooter : int, default 0
        Rows at the end to skip (0-indexed)
    convert_float : boolean, default True
        convert integral floats to int (i.e., 1.0 --> 1). If False, all numeric
        data will be read in as floats: Excel stores all numbers as floats
        internally

    Returns
    -------
    parsed : DataFrame or Dict of DataFrames
        DataFrame from the passed in Excel file.  See notes in sheet_name
        argument for more information on when a Dict of Dataframes is returned.

    Examples
    --------

    An example DataFrame written to a local file

    >>> df_out = pd.DataFrame([('string1', 1),
    ...                        ('string2', 2),
    ...                        ('string3', 3)],
    ...                       columns=['Name', 'Value'])
    >>> df_out
          Name  Value
    0  string1      1
    1  string2      2
    2  string3      3
    >>> df_out.to_excel('tmp.xlsx')

    The file can be read using the file name as string or an open file object:

    >>> pd.read_excel('tmp.xlsx')
          Name  Value
    0  string1      1
    1  string2      2
    2  string3      3

    >>> pd.read_excel(open('tmp.xlsx','rb'))
          Name  Value
    0  string1      1
    1  string2      2
    2  string3      3

    Index and header can be specified via the `index_col` and `header` arguments

    >>> pd.read_excel('tmp.xlsx', index_col=None, header=None)
         0        1      2
    0  NaN     Name  Value
    1  0.0  string1      1
    2  1.0  string2      2
    3  2.0  string3      3

    Column types are inferred but can be explicitly specified

    >>> pd.read_excel('tmp.xlsx', dtype={'Name':str, 'Value':float})
          Name  Value
    0  string1    1.0
    1  string2    2.0
    2  string3    3.0

    True, False, and NA values, and thousands separators have defaults,
    but can be explicitly specified, too. Supply the values you would like
    as strings or lists of strings!

    >>> pd.read_excel('tmp.xlsx',
    ...               na_values=['string1', 'string2'])
          Name  Value
    0      NaN      1
    1      NaN      2
    2  string3      3

    Comment lines in the excel input file can be skipped using the `comment` kwarg

    >>> df = pd.DataFrame({'a': ['1', '#2'], 'b': ['2', '3']})
    >>> df.to_excel('tmp.xlsx', index=False)
    >>> pd.read_excel('tmp.xlsx')
        a  b
    0   1  2
    1  #2  3

    >>> pd.read_excel('tmp.xlsx', comment='#')
       a  b
    0  1  2